# ===========================================================
print('存储数据')
# 很多程序都要求用户输入某种信息，如让用户存储游戏首选项或提供要可视化的数据。
# 不管专注的是什么，程序都把用户提供的信息存储在列表和字典等数据结构中。
# 用户关闭程序时，你几乎总是要保存他们提供的信息;
# 一种简单的方式是使用模块json来存储数据。

# 模块json让你能够将简单的Python数据结构转储到文件中，并在程序再次运行时加载该文件中的数据。
# 你还可以使用json在Python程序之间分享数据。
# 更重要的是，JSON数据格式并非Python专用的，这让你能够将以JSON格式存储的数据与使用其他编程语言的人分享。
# 这是一种轻便格式，很有用，也易于学习。

# 注意
# JSON(JavaScriptObjectNotation)格式最初是为JavaScript开发的，但随后成了一种常见格式，被包括Python在内的众多语言采用。


# ===========================================================
print('\n使用json.dump()和json.load()')




















